#include <stdio.h>

int main() {

    // 整数使用补码保存
    // ~(0000 1010) = 1111 0101;
    // (1111 0101)补 = (1000 1011)原
    // ~(0000 1010) = -11;
    unsigned char a = 10;
    unsigned int b = 999;
    printf("%d\n", ~a);

    char c1 = 0x12, c2 = 0xFF, c3 = 0x0F;
    // c1 为十六进制整数，二进制数为0001 0010
    // c2 为十六进制整数，二进制数为1111 1111
    // c3 为十六进制整数，二进制数为0000 1111
    // & 按位与：两个都是1则为1，否则为0
    // | 按位或：两个都是0则为0，否则为1；
    // ^ 按位异或：相同为0，不用为1
    printf("c1=%x;c2=%x;c1&c2=%x\n", c1, c2, c1 & c2);
    printf("c1=%x;c2=%x;c1|c2=%x\n", c1, c2, c1 | c2);
    printf("c1=%x;c2=%x;c1^c2=%x\n", c1, c2, c1 ^ c2); // 1110 1101 = 0xED
    printf("c1=%x;c3=%x;c1&c3=%x\n", c1, c3, c1 & c3); // 0000 0010 = 0x02
    printf("c1=%x;c3=%x;c1|c3=%x\n", c1, c3, c1 | c3); // 0001 1111 = 0x1F
    printf("c1=%x;c3=%x;c1^c3=%x\n", c1, c3, c1 ^ c3); // 0001 1101 = 0x1D

    return 0;
}